In [1]:
import numpy as np

In [2]:
import pandas as pd

### Creating a Series by converting a list, dictionary, array to a Series

In [3]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20, 'c':30}

In [4]:
my_list

[10, 20, 30]

In [5]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_list, index = labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [11]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [12]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

### Using a Series
#### The key to using a series effectively in pandas is understanding its index. Pandas makes use of index names or numbers by allowing for fast lookups of information(i.e it works like a dictionary or hashtable)

In [13]:
pd.Series([1,2,3,4], index=['USA','RUSSIA','GERMANY','UK'])

USA        1
RUSSIA     2
GERMANY    3
UK         4
dtype: int64

In [14]:
countrySeries = pd.Series([1,2,3,4], index=['USA','RUSSIA','GERMANY','UK'])

In [15]:
countrySeries

USA        1
RUSSIA     2
GERMANY    3
UK         4
dtype: int64

In [16]:
countrySeries[1]

2

In [17]:
nationalGDP = pd.Series([2,5,6,8], index=['USA','MOROCCO', 'RUSSIA','GERMANY'])

In [18]:
nationalGDP

USA        2
MOROCCO    5
RUSSIA     6
GERMANY    8
dtype: int64

In [19]:
countrySeries + nationalGDP

GERMANY    11.0
MOROCCO     NaN
RUSSIA      8.0
UK          NaN
USA         3.0
dtype: float64

# DATAFRAMES

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [20]:
from numpy.random import randn
np.random.seed(101)

In [21]:
pd.DataFrame(randn(5,4))

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [22]:
import numpy as np

In [23]:
newrand= np.random.randint(1,20,20)

In [24]:
newrand= newrand.reshape(5,4)

In [25]:
 dp= pd.DataFrame(newrand, index = 'A B C D E'.split(), columns = "W X Y Z".split())

In [26]:
dp

    W   X   Y   Z
A   8  11   8   7
B  15  10  19   8
C   8  16  13   1
D  11  13  18  12
E  16   2   5  19

In [27]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns='W X Y Z'.split())

In [28]:
df

          W         X         Y         Z
A -0.497104 -0.754070 -0.943406  0.484752
B -0.116773  1.901755  0.238127  1.996652
C -0.993263  0.196800 -1.136645  0.000366
D  1.025984 -0.156598 -0.031579  0.649826
E  2.154846 -0.610259 -0.755325 -0.346419

In [29]:
df["Addition"] = df["W"] + df["Y"]
df

          W         X         Y         Z  Addition
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510
B -0.116773  1.901755  0.238127  1.996652  0.121354
C -0.993263  0.196800 -1.136645  0.000366 -2.129908
D  1.025984 -0.156598 -0.031579  0.649826  0.994405
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521

## Selection and Indexing
#### Understanding the various methods of grabbing data from a dataframe

In [30]:
df['W']

A   -0.497104
B   -0.116773
C   -0.993263
D    1.025984
E    2.154846
Name: W, dtype: float64

In [31]:
df[:1]

          W        X         Y         Z  Addition
A -0.497104 -0.75407 -0.943406  0.484752  -1.44051

### To Access more than one column, you can do so by entering a list into the parentheses

In [32]:
df[['W','X']]

          W         X
A -0.497104 -0.754070
B -0.116773  1.901755
C -0.993263  0.196800
D  1.025984 -0.156598
E  2.154846 -0.610259

In [33]:
df[['W','Z']]

          W         Z
A -0.497104  0.484752
B -0.116773  1.996652
C -0.993263  0.000366
D  1.025984  0.649826
E  2.154846 -0.346419

In [34]:
df['added'] = df['W'] + df ['Z']

# creating a new column using data from exisiting columns

In [36]:
df["added"]

A   -0.012352
B    1.879879
C   -0.992897
D    1.675810
E    1.808428
Name: added, dtype: float64

In [37]:
df

          W         X         Y         Z  Addition     added
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510 -0.012352
B -0.116773  1.901755  0.238127  1.996652  0.121354  1.879879
C -0.993263  0.196800 -1.136645  0.000366 -2.129908 -0.992897
D  1.025984 -0.156598 -0.031579  0.649826  0.994405  1.675810
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521  1.808428

In [38]:
df

          W         X         Y         Z  Addition     added
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510 -0.012352
B -0.116773  1.901755  0.238127  1.996652  0.121354  1.879879
C -0.993263  0.196800 -1.136645  0.000366 -2.129908 -0.992897
D  1.025984 -0.156598 -0.031579  0.649826  0.994405  1.675810
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521  1.808428

#### Removing columns

In [39]:
df.drop('added', axis=1)

          W         X         Y         Z  Addition
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510
B -0.116773  1.901755  0.238127  1.996652  0.121354
C -0.993263  0.196800 -1.136645  0.000366 -2.129908
D  1.025984 -0.156598 -0.031579  0.649826  0.994405
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521

#### The sort of removal done above just removes the specified dataset on the fly, not inplace unless specified

In [40]:
df

#This shows that the new column is still there

          W         X         Y         Z  Addition     added
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510 -0.012352
B -0.116773  1.901755  0.238127  1.996652  0.121354  1.879879
C -0.993263  0.196800 -1.136645  0.000366 -2.129908 -0.992897
D  1.025984 -0.156598 -0.031579  0.649826  0.994405  1.675810
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521  1.808428

In [41]:
df.drop('added', axis=1, inplace=True)

#### This removal done above totally removes it from the dataset by setting inplace = True

In [42]:
df

          W         X         Y         Z  Addition
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510
B -0.116773  1.901755  0.238127  1.996652  0.121354
C -0.993263  0.196800 -1.136645  0.000366 -2.129908
D  1.025984 -0.156598 -0.031579  0.649826  0.994405
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521

#### Rows can be dropped this way, on the fly

In [43]:
df.drop('E', axis = 0)

          W         X         Y         Z  Addition
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510
B -0.116773  1.901755  0.238127  1.996652  0.121354
C -0.993263  0.196800 -1.136645  0.000366 -2.129908
D  1.025984 -0.156598 -0.031579  0.649826  0.994405

In [44]:
df

          W         X         Y         Z  Addition
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510
B -0.116773  1.901755  0.238127  1.996652  0.121354
C -0.993263  0.196800 -1.136645  0.000366 -2.129908
D  1.025984 -0.156598 -0.031579  0.649826  0.994405
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521

### Selecting rows

In [45]:
df.iloc[0]

W          -0.497104
X          -0.754070
Y          -0.943406
Z           0.484752
Addition   -1.440510
Name: A, dtype: float64

In [46]:
df.iloc[2]

#This selects off of position instead of labels

W          -0.993263
X           0.196800
Y          -1.136645
Z           0.000366
Addition   -2.129908
Name: C, dtype: float64

In [47]:
df.loc[['B','C'], ['W', "X"]]

          W         X
B -0.116773  1.901755
C -0.993263  0.196800

In [48]:
df.loc[['A','B'],['W','X']]

          W         X
A -0.497104 -0.754070
B -0.116773  1.901755

## Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy

In [49]:
df

          W         X         Y         Z  Addition
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510
B -0.116773  1.901755  0.238127  1.996652  0.121354
C -0.993263  0.196800 -1.136645  0.000366 -2.129908
D  1.025984 -0.156598 -0.031579  0.649826  0.994405
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521

In [50]:
df[df>0]

          W         X         Y         Z  Addition
A       NaN       NaN       NaN  0.484752       NaN
B       NaN  1.901755  0.238127  1.996652  0.121354
C       NaN  0.196800       NaN  0.000366       NaN
D  1.025984       NaN       NaN  0.649826  0.994405
E  2.154846       NaN       NaN       NaN  1.399521

In [51]:
df > 1

       W      X      Y      Z  Addition
A  False  False  False  False     False
B  False   True  False   True     False
C  False  False  False  False     False
D   True  False  False  False     False
E   True  False  False  False      True

In [52]:
df[df>0]

          W         X         Y         Z  Addition
A       NaN       NaN       NaN  0.484752       NaN
B       NaN  1.901755  0.238127  1.996652  0.121354
C       NaN  0.196800       NaN  0.000366       NaN
D  1.025984       NaN       NaN  0.649826  0.994405
E  2.154846       NaN       NaN       NaN  1.399521

In [53]:
df[df['W']>0]["Y"]

D   -0.031579
E   -0.755325
Name: Y, dtype: float64

In [54]:
df[df['W']>0]['Y']

D   -0.031579
E   -0.755325
Name: Y, dtype: float64

In [55]:
df[df['W']>0][['Y','X']]

          Y         X
D -0.031579 -0.156598
E -0.755325 -0.610259

#### For more than one condition, use keywords like (&, |) with parenthesis:

In [56]:
df

          W         X         Y         Z  Addition
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510
B -0.116773  1.901755  0.238127  1.996652  0.121354
C -0.993263  0.196800 -1.136645  0.000366 -2.129908
D  1.025984 -0.156598 -0.031579  0.649826  0.994405
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521

In [57]:
True and False

False

In [58]:
df[(df["W"]>0) | (df["Y"]>1)]

          W         X         Y         Z  Addition
D  1.025984 -0.156598 -0.031579  0.649826  0.994405
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521

In [59]:
df[(df['W']>0)|(df['Y']>1)]

          W         X         Y         Z  Addition
D  1.025984 -0.156598 -0.031579  0.649826  0.994405
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521

In [60]:
df[(df['W']>0) & (df['Y']>0)]

Empty DataFrame
Columns: [W, X, Y, Z, Addition]
Index: []

### More Index Details

In [61]:
df

          W         X         Y         Z  Addition
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510
B -0.116773  1.901755  0.238127  1.996652  0.121354
C -0.993263  0.196800 -1.136645  0.000366 -2.129908
D  1.025984 -0.156598 -0.031579  0.649826  0.994405
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521

In [62]:
#To reset an already assigned index
df.reset_index()

  index         W         X         Y         Z  Addition
0     A -0.497104 -0.754070 -0.943406  0.484752 -1.440510
1     B -0.116773  1.901755  0.238127  1.996652  0.121354
2     C -0.993263  0.196800 -1.136645  0.000366 -2.129908
3     D  1.025984 -0.156598 -0.031579  0.649826  0.994405
4     E  2.154846 -0.610259 -0.755325 -0.346419  1.399521

In [63]:
newind = 'CA NY WY OR CO'.split()

In [64]:
df['States'] = newind

In [65]:
df

          W         X         Y         Z  Addition States
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510     CA
B -0.116773  1.901755  0.238127  1.996652  0.121354     NY
C -0.993263  0.196800 -1.136645  0.000366 -2.129908     WY
D  1.025984 -0.156598 -0.031579  0.649826  0.994405     OR
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521     CO

In [66]:
df.set_index('Y')

                  W         X         Z  Addition States
Y
-0.943406 -0.497104 -0.754070  0.484752 -1.440510     CA
 0.238127 -0.116773  1.901755  1.996652  0.121354     NY
-1.136645 -0.993263  0.196800  0.000366 -2.129908     WY
-0.031579  1.025984 -0.156598  0.649826  0.994405     OR
-0.755325  2.154846 -0.610259 -0.346419  1.399521     CO

In [67]:
df

          W         X         Y         Z  Addition States
A -0.497104 -0.754070 -0.943406  0.484752 -1.440510     CA
B -0.116773  1.901755  0.238127  1.996652  0.121354     NY
C -0.993263  0.196800 -1.136645  0.000366 -2.129908     WY
D  1.025984 -0.156598 -0.031579  0.649826  0.994405     OR
E  2.154846 -0.610259 -0.755325 -0.346419  1.399521     CO

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [68]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [69]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [70]:
df = pd.DataFrame(np.random.randn(6,2),index = hier_index, columns = ['A','B'])
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [71]:
df.loc['G1']

          A         B
1  0.147027 -0.479448
2  0.558769  1.024810
3 -0.925874  1.862864

In [72]:
df.loc['G1'].loc[1]

A    0.147027
B   -0.479448
Name: 1, dtype: float64

In [73]:
df.index.names

FrozenList([None, None])

In [74]:
df.index.names = ['Group','Num']

In [75]:
df

                  A         B
Group Num
G1    1    0.147027 -0.479448
      2    0.558769  1.024810
      3   -0.925874  1.862864
G2    1   -1.133817  0.610478
      2    0.386030  2.084019
      3   -0.376519  0.230336

In [76]:
df.xs('G1')

            A         B
Num
1    0.147027 -0.479448
2    0.558769  1.024810
3   -0.925874  1.862864

In [77]:
df.xs(['G1',1])

A    0.147027
B   -0.479448
Name: (G1, 1), dtype: float64

In [78]:
df.xs(1,level='Num')

              A         B
Group
G1     0.147027 -0.479448
G2    -1.133817  0.610478